In [2]:
# package imports
import pandas as pd
import numpy as np 
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import matplotlib.pyplot as plt
%matplotlib inline

# 数据结构

pandas的数据结构有Series和DataFrame。Series

Python中的list、NumPy中Narray、Pandas中Series、DataFrame

1. list是python的内置数据类型，list中的数据类型不必相同的
2. Narray所存放的数据类型必须全部相同、会尽可能将输入数据视为多维、效率比list高
3. Series无论是输入还是输出，数据都是一维,数据类型不必相同
4. DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值类型。DataFrame的每一列可以看做是一个Series

## Series

Series与普通一维数组的区别在于，它多了一组与之相关的数据标签(比如：index)

### 创建

series通常通过传入一组list创建，若不指定索引，则会自动创建一个0到N-1（N为数组长度）的整数型索引

In [108]:
se = pd.Series([4, 7, -5, 3], index=['a', 'b', 'c', 'd'])
se
type(se1.values)
type(se1.index)
se.name = 'name_test'
se.index.name = 'in'
se

a    4
b    7
c   -5
d    3
dtype: int64

numpy.ndarray

pandas.core.indexes.base.Index

in
a    4
b    7
c   -5
d    3
Name: name_test, dtype: int64

### 索引
Series索引方式主要有以下三种，索引值由index的数据类型决定，既可以为整数，也可以为str
1. 像数组一样
2. 传入一个list
3. 布尔运算

In [31]:
#用数组方式索引
se['a']
#用切片
se['d':'a']
#布尔运算
se[se>3] #等价于se[se.values>3]

4

Series([], Name: name_test, dtype: int64)

in
a    4
b    7
Name: name_test, dtype: int64

### 修改和删除

In [34]:
#修改
se['a'] = 8
se
#增加
se['e'] = 10
se
#删除
se.drop('a')

in
a     8
b     7
c    -5
d     3
e    10
Name: name_test, dtype: int64

in
a     8
b     7
c    -5
d     3
e    10
Name: name_test, dtype: int64

in
b     7
c    -5
d     3
e    10
Name: name_test, dtype: int64

### 属性
对于一个Series，其中最常用的属性为值（values），索引（index），名字（name），类型（dtype）  
更多属性：https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html

In [39]:
se.values
se.index
se.name
se.dtype

array([ 8,  7, -5,  3, 10])

Index(['a', 'b', 'c', 'd', 'e'], dtype='object', name='in')

'name_test'

dtype('int64')

## DataFrame
DataFrame是一个二维的表结构，它含有一组有序的列。DataFrame既有行索引又有列索引，它可以被看做由Series组成的字典。

### 创建
最常见的方法就是直接传入一个由等长列表或数组组成的字典。若不指定行索引，则会自动创建一个0到N-1（N为数组长度）的整数型索引
若不指定列索引，则字典的键作为列索引

In [122]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', np.nan],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5     NaN  2003  3.2

### 索引

索引方法繁多，且功能重叠，这里介绍最常用的三种：

1. []操作符
2. loc方法、iloc方法
3. 常用索引型函数where、query

#### []操作符

[]操作符常用于列选择，尽量避免行的选择,行选择用loc较好

In [84]:
#单行索引，单行索引出来就是一个Series
df_loc_1 =  df[1:2] #必须用切片，不能df[1]，所以用[]操作符做行索引很不舒服
df_loc_1
type(df_loc_1)

#多行索引，多行索引出来还是DataFrame
df[1:3]


#单列索引
df['state']


#多列索引
df[['state','year']]


#函数式索引
df[lambda x:['state', 'year']] #[]中使用的函数，传入参数就是前面的df


#布尔索引
df[df['year']==2001]
df[df['year'].isin([2001,2002])]
df[df['state'].notna()]

  state  year  pop
1  Ohio  2001  1.7

pandas.core.frame.DataFrame

  state  year  pop
1  Ohio  2001  1.7
2  Ohio  2002  3.6

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5       NaN
Name: state, dtype: object

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5     NaN  2003

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5     NaN  2003

    state  year  pop
1    Ohio  2001  1.7
3  Nevada  2001  2.4

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

#### loc方法、iloc方法

1. loc是对行标签、列标签进行索引；iloc是对行号、列号进行索引
2. 在loc中使用的切片全部包含右端点！在iloc中的切片不包含！对此我也很无语呀~
3. 本质上loc中能传入的只有布尔列表和索引子集构成的列表，只要把握这个原则就很容易理解上面那些操作。iloc中接收的参数只能为整数或整数列表，不能使用布尔索引

In [85]:
#单行索引，单行索引出来就是一个Series
df_loc_1 =  df.loc[1]
df_loc_1
df.iloc[1] #这里因为行标签和行号相同，所以取值一样
type(df_loc_1)

#多行索引，多行索引出来还是DataFrame
df.loc[1:3]


#单列索引
df.loc[:,'state']
df.iloc[:,0]


#多列索引
df.loc[:,['state','year']]
df.loc[:, 'state':'year'] #与上面等价

df.iloc[:,0]
df.iloc[:,0:2]

#行列混合索引
df.loc[1:2,['state','year']]
df.iloc[1:3,0:2]

#函数式索引
df.loc[lambda x:x['year']==2001] #loc中使用的函数，传入参数就是前面的df


#布尔索引
df.loc[df['year']==2001]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

pandas.core.series.Series

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5       NaN
Name: state, dtype: object

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5       NaN
Name: state, dtype: object

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5     NaN  2003

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5     NaN  2003

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5       NaN
Name: state, dtype: object

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5     NaN  2003

  state  year
1  Ohio  2001
2  Ohio  2002

  state  year
1  Ohio  2001
2  Ohio  2002

    state  year  pop
1    Ohio  2001  1.7
3  Nevada  2001  2.4

    state  year  pop
1    Ohio  2001  1.7
3  Nevada  2001  2.4

#### 常用索引型函数
这里仅介绍用的较多的where、query

In [89]:
#where
df.where(df['state']=='Ohio') #不满足条件的行全部被设置为NaN

#query，类似于数据库的查询语法
#query函数中的布尔表达式中，这些符号都是合法的：行列索引名、字符串、and/not/or/&/|/~/not in/in/==/!=、四则运算符
df.query('(pop > 1.8) & year in [2001, 2002]')

  state    year  pop
0  Ohio  2000.0  1.5
1  Ohio  2001.0  1.7
2  Ohio  2002.0  3.6
3   NaN     NaN  NaN
4   NaN     NaN  NaN
5   NaN     NaN  NaN

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

### 修改

对某一列进行修改，用[]操作符较好，因为方便

对某一行某一列进行修改，用loc、iloc较好，因为用[]操作符可能修改的只是副本。
具体官方解释：https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [120]:
#列修改
df['tem'] = 0
df

#行列修改
df.loc[:1,'tem'] = 2
df

df['tem'][:1] = 1 #会出现警告
df

    state  year  pop  tem
0    Ohio  2000  1.5    0
1    Ohio  2001  1.7    0
2    Ohio  2002  3.6    0
3  Nevada  2001  2.4    0
4  Nevada  2002  2.9    0
5     NaN  2003  3.2    0

    state  year  pop  tem
0    Ohio  2000  1.5    2
1    Ohio  2001  1.7    2
2    Ohio  2002  3.6    0
3  Nevada  2001  2.4    0
4  Nevada  2002  2.9    0
5     NaN  2003  3.2    0

/Users/maowei/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

    state  year  pop  tem
0    Ohio  2000  1.5    1
1    Ohio  2001  1.7    2
2    Ohio  2002  3.6    0
3  Nevada  2001  2.4    0
4  Nevada  2002  2.9    0
5     NaN  2003  3.2    0

### 删除

In [121]:
#删除指定行列
#drop，inplace代表是否在原对象基础上进行修改，默认是False，即创建新的对象进行修改，原对象不变，与深拷贝和浅拷贝有些类似
df.drop(columns='tem', inplace = True)
df

df.drop(index=5, inplace = True)
df

#删除重复元素
#可选参数keep默认为first，即保留重复元素第一个，若为last，则保留最后一个，若为False，则全部删除
df.drop_duplicates('year', keep='first', inplace=True)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5     NaN  2003  3.2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

### 属性
对于一个DataFrame，其中最常用的属性为值（values），索引（index），维度(shape)，列名（columns），类型（dtype)

In [123]:
df.columns
df.index
df.shape
df.dtypes

Index(['state', 'year', 'pop'], dtype='object')

RangeIndex(start=0, stop=6, step=1)

(6, 3)

state     object
year       int64
pop      float64
dtype: object